; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	thermograph1 - mode
	Star2 - direction
	GroundStation6 - direction
	Star12 - direction
	GroundStation13 - direction
	Star10 - direction
	Star11 - direction
	Star8 - direction
	Star14 - direction
	Star0 - direction
	Star7 - direction
	Star3 - direction
	Star1 - direction
	Star9 - direction
	Star4 - direction
	Star5 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star8)
	(supports instrument2 image0)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star11)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 Star8)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star9)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(have_image Star15 thermograph1)
	(have_image Phenomenon16 image0)
	(have_image Star17 image0)
	(have_image Planet18 image0)
	(have_image Planet19 image0)
	(have_image Planet20 image0)
	(have_image Phenomenon21 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 planet19 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet19)
   goals met: 0 of 7
4. (take_image satellite0 planet19 instrument0 image0)
   added: (have_image planet19 image0)
   goals met: 1 of 7
5. (turn_to satellite0 planet18 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet18)
   goals met: 1 of 7
6. (take_image satellite0 planet18 instrument0 image0)
   added: (have_image planet18 image0)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon21 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 phenomenon21)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon21 instrument0 thermograph1)
   added: (have_image phenomenon21 thermograph1)
   goals met: 3 of 7
9. (turn_to satellite0 phenomenon16 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 phenomenon16)
   goals met: 3 of 7
10. (take_image satellite0 phenomenon16 instrument0 image0)
   added: (have_image phenomenon16 image0)
   goals met: 4 of 7
11. (turn_to satellite0 planet20 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet20)
   goals met: 4 of 7
12. (take_image satellite0 planet20 instrument0 image0)
   added: (have_image planet20 image0)
   goals met: 5 of 7
13. (turn_to satellite0 star15 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 star15)
   goals met: 5 of 7
14. (take_image satellite0 star15 instrument0 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 6 of 7
15. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 6 of 7
16. (take_image satellite0 star17 instrument0 image0)
   added: (have_image star17 image0)
   goals met: 7 of 7
